/**
 * @author:weilai
 * @Data:2021年2月26日下午12:13:54
 * @Org:Sentury Co., ltd.
 * @Deparment:Domestic Sales, Tech Center
 * @Desc: <li>
 */

package com.leesky.ezframework.backend.config;

public enum NicknameEnum {
    a0(0, "飞翔的鱼"), a1(1, "只沾花不惹草动"), a2(2, "暗恋最省钱"), a3(3, "啪啪啪能量"), a4(4, "骑狗三人组"), a5(5, "牛郎侄女"), a6(6, "甜的一本正经"), a7(7, "你妻负我"), a8(8, "懶得取名"), a9(9, "爱在戏院前"), a10(10, "拯救胡萝卜"), a11(11, "偷看你洗澡"), a12(12, "鬼魅般旳笑"), a13(13, "鱼死海"), a14(14, "冒牌小冬瓜"), a15(15, "兜兜里藏着糖"), a16(16, "腐眼看人基"), a17(17, "酷是姐的本性"), a18(18, "有宦官想害朕"), a19(19, "马上有钱"), a20(20, "海上花洲"), a21(21, "讨厌鬼吗"), a22(22, "自愚自乐"), a23(23, "闪光小龙虾"), a24(24, "我又杀猪了"),
    a25(25, "想跟你鬼混"), a26(26, "限量版逗比"), a27(27, "全村的希望"), a28(28, "一脸美人痣"), a29(29, "仙猪"), a30(30, "死亡与爱"), a31(31, "悲殇入画"), a32(32, "泪落在梦中"), a33(33, "浮云的痛"), a34(34, "等尽歌悲欢"), a35(35, "寂寞心空"), a36(36, "一地悲伤"), a37(37, "风声过后的凉"), a38(38, "我怕梦醒"), a39(39, "现在开始忘记"), a40(40, "泪湿双眼"), a41(41, "却为相思困"), a42(42, "只会更难过"), a43(43, "心碎到迷离"), a44(44, "祠梦余生"), a45(45, "一夕笙歌"), a46(46, "挽弦暮笙"), a47(47, "空叹花语意"),
    a48(48, "笙歌相知"), a49(49, "等尽歌悲"), a50(50, "久醉绕心弦"), a51(51, "夏日浅笑"), a52(52, "琉璃年华"), a53(53, "终有千种风情"), a54(54, "花谢为谁悲"), a55(55, "姻缘词"), a56(56, "一季烟雨"), a57(57, "长情书"), a58(58, "长生遥"), a59(59, "墨染樱飞"), a60(60, "且听风铃"), a61(61, "雨晨的清风"), a62(62, "伊人泪满面"), a63(63, "如花的旋律"), a64(64, "花舞花落"), a65(65, "深巷的猫"), a66(66, "云纹梦纷蝶"), a67(67, "闪耀旳白梦"), a68(68, "深渊的那支花"), a69(69, "回忆的沙漏"), a70(70, "潮起潮落"),
    a71(71, "化思念为星"), a72(72, "不再回忆"), a73(73, "三字故事"), a74(74, "一瞬之光"), a75(75, "笑饮孤鸿"), a76(76, "笑看浮华"), a77(77, "蔑王侯"), a78(78, "风吻"), a79(79, "我在上帝心中"), a80(80, "枭雄万人迷"), a81(81, "姑娘拽天下"), a82(82, "咫尺天涯间"), a83(83, "霸气外露"), a84(84, "请叫我女王"), a85(85, "天生傲骨"), a86(86, "撩妹一把手"), a87(87, "单剑走天涯"), a88(88, "撕裂你的心"), a89(89, "霸绝苍生"), a90(90, "孤寂深海"), a91(91, "世事苍凉"), a92(92, "翩若惊鸿"), a93(93, "尤物佳人"), a94(94, "自心难控"),
    a95(95, "泪水不甜"), a96(96, "眉眼深情"), a97(97, "灯火阑珊"), a98(98, "清欢不散"), a99(99, "清峭日暮"), a100(100, "沧笙踏歌"), a101(101, "谨言慎行"), a102(102, "勿念初心"), a103(103, "别来无恙"), a104(104, "词抒笙歌"), a105(105, "不动就胖了"), a106(106, "神经科常客"), a107(107, "阳光下暖和"), a108(108, "皇冠贵族"), a109(109, "遛狗的小肥女"), a110(110, "金屋藏我"), a111(111, "对方正在偷人"), a112(112, "掐死你的温柔"), a113(113, "少年包青蛙"), a114(114, "萌面欧巴桑"), a115(115, "软嘟嘟"),
    a116(116, "久伴依赖病"), a117(117, "枯萌面怪"), a118(118, "牵羊逛街的狼"), a119(119, "跑调情歌"), a120(120, "我贱故我在"), a121(121, "假仙女真汉子"), a122(122, "马叉虫"), a123(123, "不毒枉为女子"), a124(124, "月光下晒太阳"), a125(125, "逆行呆子"), a126(126, "软声猫吟"), a127(127, "扑倒李太白"), a128(128, "心里老鸭汤"), a129(129, "浆果红细胞"), a130(130, "屈丝贩卖机"), a131(131, "甜味少女馆"), a132(132, "绿绿大吉"), a133(133, "嗲死了"), a134(134, "心碎红颜"), a135(135, "不堪回首"), a136(136, "如果只剩下愛"),
    a137(137, "执妄散尽"), a138(138, "清欢不散"), a139(139, "难忘最初的你"), a140(140, "错过了"), a141(141, "这一刻失恋"), a142(142, "梦碎独自一个人"), a143(143, "凉薄的感情"), a144(144, "破碎的心"), a145(145, "余生我是路过"), a146(146, "怀念或痛"), a147(147, "逝雪深笑意"), a148(148, "再无感情"), a149(149, "阡陌红尘"), a150(150, "岛森屿夏"), a151(151, "风落尘归去"), a152(152, "起执妄散尽"), a153(153, "欢惜醉颜"), a154(154, "落日海湾"), a155(155, "泽畔东篱"), a156(156, "风轻花落"), a157(157, "执笔画素颜"),
    a158(158, "半字浅眉"), a159(159, "酒朋诗侣"), a160(160, "凉花念伊人"), a161(161, "挚瑶满夙缘"), a162(162, "执手问"), a163(163, "相思阙风"), a164(164, "微光倾城"), a165(165, "烛光里的愿"), a166(166, "青丝茧"), a167(167, "代价是折磨"), a168(168, "泪梦里花"), a169(169, "漫步云海涧"), a170(170, "阳光温暖"), a171(171, "橱窗的光"), a172(172, "地平线无际"), a173(173, "黑魅惑"), a174(174, "半颗心的暖"), a175(175, "流苏书包"), a176(176, "谁海氹有点甜"), a177(177, "乱世小熊"), a178(178, "萌傻卿"),
    a179(179, "桀骜如初"), a180(180, "苍生一步一灭"), a181(181, "手不毒人"), a182(182, "一斩死囚"), a183(183, "枭雄万人迷"), a184(184, "一代女皇"), a185(185, "大主宰"), a186(186, "裙下之臣"), a187(187, "帅的好烦躁"), a188(188, "萌妹纸"), a189(189, "浪货界扛把子"), a190(190, "国产小祖宗"), a191(191, "嗜血死神"), a192(192, "霸气风云"), a193(193, "野尽风尘"), a194(194, "离殇荡情"), a195(195, "永不言变"), a196(196, "清烟无瘾"), a197(197, "南鸢离梦"), a198(198, "岁月静好"), a199(199, "我想你笑"),
    a200(200, "移情别恋"), a201(201, "飞颜尘雪"), a202(202, "黑色蔷薇"), a203(203, "盈笑凝眸"), a204(204, "菁华浮梦"), a205(205, "陪你入睡"), a206(206, "久日与至"), a207(207, "伴你苦乐"), a208(208, "故友旧事"), a209(209, "师太别开灯"), a210(210, "你丑到我了"), a211(211, "奔跑吧闺蜜"), a212(212, "情场通缉犯"), a213(213, "武林萌主"), a214(214, "山猪口服液"), a215(215, "无鞋的呆呆"), a216(216, "贱是一种态度"), a217(217, "长的省流量"), a218(218, "越王够贱"), a219(219, "无情的泡面"), a220(220, "水却要煮鱼"),
    a221(221, "廋果冻不丁"), a222(222, "嚣张的废铁"), a223(223, "闪电劈裤裆"), a224(224, "爱屋及污"), a225(225, "养猪仙人"), a226(226, "男神沒有经"), a227(227, "雷鸣八千里"), a228(228, "不死的鸟人"), a229(229, "姜子牙疼"), a230(230, "正宗傻白甜"), a231(231, "拱白菜的小猪"), a232(232, "兔子与猪"), a233(233, "旺仔小裤头"), a234(234, "几勺奶酪"), a235(235, "猪婆的执迷"), a236(236, "漂亮嫂子"), a237(237, "今晚吃兔兔 "), a238(238, "泪遗弃在时光"), a239(239, "弃深爱"), a240(240, "带殇的挽歌"), a241(241, "割舍不下"),
    a242(242, "交换孤独"), a243(243, "刺痛的心"), a244(244, "曾经凋零的话"), a245(245, "一直都伤心"), a246(246, "暖不了的心"), a247(247, "太痴狂太忧伤"), a248(248, "妄想徒手摘星"), a249(249, "笑忘身是客"), a250(250, "垂帘落泪"), a251(251, "浅逾期的伤心"), a252(252, "心事泪流中 "), a253(253, "雨霖蝶恋花"), a254(254, "银笺别梦"), a255(255, "带殇的挽歌"), a256(256, "竹笙锦瑟"), a257(257, "无梦相赠"), a258(258, "空叹花语意"), a259(259, "浅嫣婉语"), a260(260, "早醉雨苦竹泪"), a261(261, "浮光初槿花落"),
    a262(262, "长歌潇潇"), a263(263, "年少如诗如歌"), a264(264, "泪浓情浅浅"), a265(265, "清风引酒"), a266(266, "年华青瓷"), a267(267, "追烟花雨"), a268(268, "偷得浮生"), a269(269, "紫色的彩虹"), a270(270, "微醉阳光"), a271(271, "倚靠窗畔"), a272(272, "浅浅嫣然笑"), a273(273, "执手不忆殇"), a274(274, "空屋触摸阳光"), a275(275, "初晓微芒"), a276(276, "烟雨彷徨"), a277(277, "钢琴上的芭蕾"), a278(278, "焰火灿烂时"), a279(279, "芭比萌妹"), a280(280, "梦梦贝莉雅"), a281(281, "呵呵恩恩哦"), a282(282, "勇敢的小萝卜"),
    a283(283, "乱世狂傲"), a284(284, "耀世天下"), a285(285, "不服拿钱砸你脸"), a286(286, "漫步送葬者"), a287(287, "霸道我的个性"), a288(288, "亚洲首帅"), a289(289, "霸气不需要"), a290(290, "战天傲刃"), a291(291, "孤者何惧"), a292(292, "霸气范给朕跪下"), a293(293, "世界是我的"), a294(294, "虐菜是享受"), a295(295, "纵马取敌首"), a296(296, "气质拿稳你"), a297(297, "跪下唱征服"), a298(298, "游于长野"), a299(299, "陪你演戏"), a300(300, "惟于莽莽"), a301(301, "木槿昔年"), a302(302, "夏已微凉"), a303(303, "久居深海"),
    a304(304, "青涩懵懂"), a305(305, "旧巷情人"), a306(306, "笔墨书香"), a307(307, "淡若清风"), a308(308, "任由漂泊"), a309(309, "挽袖清风"), a310(310, "未曾忘你"), a311(311, "烈酒烫心"), a312(312, "讲给风听"), a313(313, "跳进海里躲雨"), a314(314, "动力火锅"), a315(315, "朕就是萌萌哒");

    private final Integer key;

    private final String value;

    NicknameEnum(Integer key, String value) {
        this.key = key;
        this.value = value;
    }

    public Integer getKey() {
        return key;
    }


    public static String getValue(Integer key) {
        for (NicknameEnum n : NicknameEnum.values()) {
            if (n.getKey().equals(key))
                return n.value;

        }

        return null;
    }

}
